app/workers/chat_worker.rb

SELECT  `applications`.* FROM `applications` WHERE `applications`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `chats` WHERE `chats`.`application_id` = 2
INSERT INTO `chats` (`application_id`, `name`, `created_at`, `updated_at`, `number`) VALUES (2, 'ICPC with locks', '2024-05-28 02:49:04', '2024-05-28 02:49:04', 1)
SELECT COUNT(*) FROM `chats` WHERE `chats`.`application_id` = 1
UPDATE `applications` SET `channel_count` = 5, `updated_at` = '2024-05-28 03:13:15' WHERE `applications`.`id` = 1
---
    def perform(application_id, name)
      application = Application.find(application_id)
      application.with_lock do
        chat = application.chats.new(name: name)
        chat.number = application.chats.count + 1
        chat.save!
        application.update(channel_count: application.chats.count)