app/workers/message_worker.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `messages` WHERE `messages`.`chat_id` = 1
INSERT INTO `messages` (`chat_id`, `number`, `body`, `created_at`, `updated_at`) VALUES (1, 1, 'hellloooooo ?!?!', '2024-05-28 02:49:30', '2024-05-28 02:49:30')
UPDATE `chats` SET `messages_count` = 1, `updated_at` = '2024-05-28 02:49:30' WHERE `chats`.`id` = 1
---
    def perform(chat_id, body)
      chat = Chat.find(chat_id)
      chat.with_lock do
        message = chat.messages.new(body: body)
        message.number = chat.messages.count + 1
        message.save!
        chat.update(messages_count: chat.messages.count)