app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT `applications`.* FROM `applications`

  def create
    @application = Application.new(application_params)
    if @application.save
---
INSERT INTO `applications` (`token`, `created_at`, `updated_at`, `name`) VALUES ('03a9c6d5688a52fcc97f', '2024-05-27 21:59:22', '2024-05-27 21:59:22', 'Application 1')

  def show
    @application = Application.find_by(token: params[:token])
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '03a9c6d5688a52fcc97f' LIMIT 1