app/controllers/chats_controller.rb

  def index
    @application = Application.find_by(token: params[:token])
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '5ce663788bd890bcb2df' LIMIT 1

  def create
    @application = Application.find_by(token: params[:token])
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`token` = '5ce663788bd890bcb2df' LIMIT 1

  def show
    @chat = Chat.find(params[:id])
---
SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1