app/controllers/messages_controller.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1
---
  def index
    @chat = Chat.find(params[:chat_id])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1
---
  def create
    @chat = Chat.find(params[:chat_id])

SELECT `messages`.* FROM `messages` WHERE 1=0
---
  def search
    if params[:query].blank?
      render json: { error: "Query cannot be blank" }, status: :bad_request
    else
      @messages = Message.search_in_chat(params[:chat_id], params[:query]).records.to_a