app/models/message.rb

SELECT  `messages`.* FROM `messages` ORDER BY `messages`.`id` ASC LIMIT 1000
---
  def self.search_in_chat(chat_id, query)
    __elasticsearch__.search(
      {
        query: {
          bool: {
            must: [
              { wildcard: { body: "*#{query}*" } },
              { term: { chat_id: chat_id } }
            ]
          }
        }
      }
    )